#include <fstream>
#include <iostream>
using namespace std;

int main()
{
    //ofstream outfile("newfile.txt");
    //outfile << "Я пишу в режиме char*\n" << "Мне надо проверить, как я буду считывать строки которые я только что записал\n" << "Я запишу лишь четыре строки,\n" << "Но мне должно хватить";
    char buffer[80];
    ifstream infile("newfile.txt");
    while (!infile.eof()) {
        infile.getline(buffer, 80);
        cout << buffer;
    }
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
